#version: 0.2
Ġ 0
Ġ 1
Ġ -
3 0
Ġ1 5
a t
d at
Ġ 30
Ġ30 0
2 4
1 0
9 0
5 0
7 0
2 0
Ġ1 1
5 6
Ġ1 0
Ġ 24
Ġ 8
Ġ300 3
Ġ300 4
Ġ300 5
Ġ24 56
Ġ 6
Ġ300 2
Ġ300 1
Ġ 4
Ġ 9
Ġ 7
Ġ 3
Ġ 5
Ġ 2
4 8
7 2
6 0
Ġ1 2
8 0
9 6
4 0
1 6
1 20
1 4
14 4
16 8
1 9
19 2
0 0
24 0
2 16
Ġ12 10
Ġ12 30
Ġ11 90
Ġ11 70
Ġ1 10
Ġ11 50
Ġ12 50
Ġ11 30
Ġ 90
20 0
Ġ11 10
Ġ 70
Ġ10 90
Ġ10 70
Ġ10 50
Ġ10 30
Ġ8 10
Ġ8 50
Ġ10 10
Ġ6 10
Ġ9 70
Ġ5 50
Ġ5 30
Ġ6 30
Ġ9 90
Ġ5 10
Ġ8 30
Ġ7 50
Ġ5 90
Ġ9 10
Ġ5 70
Ġ8 70
Ġ6 90
Ġ6 50
Ġ9 50
Ġ7 90
Ġ8 90
Ġ6 70
Ġ4 70
Ġ7 30
Ġ4 90
Ġ4 50
Ġ3 50
Ġ7 70
Ġ9 30
Ġ7 10
Ġ4 30
Ġ3 70
Ġ4 10
Ġ 50
Ġ3 90
Ġ3 30
Ġ2 70
Ġ2 90
Ġ3 10
Ġ2 50
Ġ2 30
Ġ2 10
Ġ1 90
Ġ1 70
Ġ15 0
Ġ1 30
Ġ1 240
Ġ12 20
2 6
26 4
Ġ1 200
Ġ11 80
Ġ11 60
Ġ11 40
Ġ11 20
Ġ110 0
Ġ10 80
Ġ10 40
Ġ10 20
Ġ5 20
Ġ10 60
Ġ8 40
Ġ8 20
Ġ8 00
Ġ12 60
Ġ4 60
Ġ 56
Ġ56 0
Ġ9 80
Ġ7 40
Ġ6 20
Ġ8 60
Ġ6 80
Ġ8 80
Ġ7 80
Ġ90 0
Ġ6 60
Ġ5 40
Ġ6 40
Ġ6 00
Ġ5 80
Ġ3 40
Ġ4 40
Ġ9 40
Ġ7 60
Ġ4 80
Ġ7 20
Ġ9 20
Ġ9 60
Ġ10 00
Ġ4 00
Ġ50 0
Ġ70 0
Ġ3 60
Ġ4 20
Ġ24 0
Ġ3 80
Ġ3 20
Ġ2 80
Ġ2 60
Ġ2 20
Ġ 200
Ġ1 80
Ġ1 60
2 8
28 8
Ġ1 40
Ġ1 20
Ġ10 0
Ġ8 0
Ġ6 0
1 2
3 12
Ġ4 0
Ġ 20
3 3
33 6
3 60
3 8
38 4
40 8
3 2
4 32
4 56
48 0
50 4
5 28
5 2
5 52
5 7
57 6
60 0
6 24
6 48
6 72
