{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": true
    },
    {
      "id": 1,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "<mask>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": "",
    "end_of_word_suffix": "",
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "<|endoftext|>": 0,
      "<s>": 1,
      "<pad>": 2,
      "</s>": 3,
      "<unk>": 4,
      "<mask>": 5,
      "!": 6,
      "\"": 7,
      "#": 8,
      "$": 9,
      "%": 10,
      "&": 11,
      "'": 12,
      "(": 13,
      ")": 14,
      "*": 15,
      "+": 16,
      ",": 17,
      "-": 18,
      ".": 19,
      "/": 20,
      "0": 21,
      "1": 22,
      "2": 23,
      "3": 24,
      "4": 25,
      "5": 26,
      "6": 27,
      "7": 28,
      "8": 29,
      "9": 30,
      ":": 31,
      ";": 32,
      "<": 33,
      "=": 34,
      ">": 35,
      "?": 36,
      "@": 37,
      "A": 38,
      "B": 39,
      "C": 40,
      "D": 41,
      "E": 42,
      "F": 43,
      "G": 44,
      "H": 45,
      "I": 46,
      "J": 47,
      "K": 48,
      "L": 49,
      "M": 50,
      "N": 51,
      "O": 52,
      "P": 53,
      "Q": 54,
      "R": 55,
      "S": 56,
      "T": 57,
      "U": 58,
      "V": 59,
      "W": 60,
      "X": 61,
      "Y": 62,
      "Z": 63,
      "[": 64,
      "\\": 65,
      "]": 66,
      "^": 67,
      "_": 68,
      "`": 69,
      "a": 70,
      "b": 71,
      "c": 72,
      "d": 73,
      "e": 74,
      "f": 75,
      "g": 76,
      "h": 77,
      "i": 78,
      "j": 79,
      "k": 80,
      "l": 81,
      "m": 82,
      "n": 83,
      "o": 84,
      "p": 85,
      "q": 86,
      "r": 87,
      "s": 88,
      "t": 89,
      "u": 90,
      "v": 91,
      "w": 92,
      "x": 93,
      "y": 94,
      "z": 95,
      "{": 96,
      "|": 97,
      "}": 98,
      "~": 99,
      "¡": 100,
      "¢": 101,
      "£": 102,
      "¤": 103,
      "¥": 104,
      "¦": 105,
      "§": 106,
      "¨": 107,
      "©": 108,
      "ª": 109,
      "«": 110,
      "¬": 111,
      "®": 112,
      "¯": 113,
      "°": 114,
      "±": 115,
      "²": 116,
      "³": 117,
      "´": 118,
      "µ": 119,
      "¶": 120,
      "·": 121,
      "¸": 122,
      "¹": 123,
      "º": 124,
      "»": 125,
      "¼": 126,
      "½": 127,
      "¾": 128,
      "¿": 129,
      "À": 130,
      "Á": 131,
      "Â": 132,
      "Ã": 133,
      "Ä": 134,
      "Å": 135,
      "Æ": 136,
      "Ç": 137,
      "È": 138,
      "É": 139,
      "Ê": 140,
      "Ë": 141,
      "Ì": 142,
      "Í": 143,
      "Î": 144,
      "Ï": 145,
      "Ð": 146,
      "Ñ": 147,
      "Ò": 148,
      "Ó": 149,
      "Ô": 150,
      "Õ": 151,
      "Ö": 152,
      "×": 153,
      "Ø": 154,
      "Ù": 155,
      "Ú": 156,
      "Û": 157,
      "Ü": 158,
      "Ý": 159,
      "Þ": 160,
      "ß": 161,
      "à": 162,
      "á": 163,
      "â": 164,
      "ã": 165,
      "ä": 166,
      "å": 167,
      "æ": 168,
      "ç": 169,
      "è": 170,
      "é": 171,
      "ê": 172,
      "ë": 173,
      "ì": 174,
      "í": 175,
      "î": 176,
      "ï": 177,
      "ð": 178,
      "ñ": 179,
      "ò": 180,
      "ó": 181,
      "ô": 182,
      "õ": 183,
      "ö": 184,
      "÷": 185,
      "ø": 186,
      "ù": 187,
      "ú": 188,
      "û": 189,
      "ü": 190,
      "ý": 191,
      "þ": 192,
      "ÿ": 193,
      "Ā": 194,
      "ā": 195,
      "Ă": 196,
      "ă": 197,
      "Ą": 198,
      "ą": 199,
      "Ć": 200,
      "ć": 201,
      "Ĉ": 202,
      "ĉ": 203,
      "Ċ": 204,
      "ċ": 205,
      "Č": 206,
      "č": 207,
      "Ď": 208,
      "ď": 209,
      "Đ": 210,
      "đ": 211,
      "Ē": 212,
      "ē": 213,
      "Ĕ": 214,
      "ĕ": 215,
      "Ė": 216,
      "ė": 217,
      "Ę": 218,
      "ę": 219,
      "Ě": 220,
      "ě": 221,
      "Ĝ": 222,
      "ĝ": 223,
      "Ğ": 224,
      "ğ": 225,
      "Ġ": 226,
      "ġ": 227,
      "Ģ": 228,
      "ģ": 229,
      "Ĥ": 230,
      "ĥ": 231,
      "Ħ": 232,
      "ħ": 233,
      "Ĩ": 234,
      "ĩ": 235,
      "Ī": 236,
      "ī": 237,
      "Ĭ": 238,
      "ĭ": 239,
      "Į": 240,
      "į": 241,
      "İ": 242,
      "ı": 243,
      "Ĳ": 244,
      "ĳ": 245,
      "Ĵ": 246,
      "ĵ": 247,
      "Ķ": 248,
      "ķ": 249,
      "ĸ": 250,
      "Ĺ": 251,
      "ĺ": 252,
      "Ļ": 253,
      "ļ": 254,
      "Ľ": 255,
      "ľ": 256,
      "Ŀ": 257,
      "ŀ": 258,
      "Ł": 259,
      "ł": 260,
      "Ń": 261,
      "Ġ0": 262,
      "Ġ1": 263,
      "Ġ-": 264,
      "30": 265,
      "Ġ15": 266,
      "at": 267,
      "dat": 268,
      "Ġ30": 269,
      "Ġ300": 270,
      "24": 271,
      "10": 272,
      "90": 273,
      "50": 274,
      "70": 275,
      "20": 276,
      "Ġ11": 277,
      "56": 278,
      "Ġ10": 279,
      "Ġ24": 280,
      "Ġ8": 281,
      "Ġ3003": 282,
      "Ġ3004": 283,
      "Ġ3005": 284,
      "Ġ2456": 285,
      "Ġ6": 286,
      "Ġ3002": 287,
      "Ġ3001": 288,
      "Ġ4": 289,
      "Ġ9": 290,
      "Ġ7": 291,
      "Ġ3": 292,
      "Ġ5": 293,
      "Ġ2": 294,
      "48": 295,
      "72": 296,
      "60": 297,
      "Ġ12": 298,
      "80": 299,
      "96": 300,
      "40": 301,
      "16": 302,
      "120": 303,
      "14": 304,
      "144": 305,
      "168": 306,
      "19": 307,
      "192": 308,
      "00": 309,
      "240": 310,
      "216": 311,
      "Ġ1210": 312,
      "Ġ1230": 313,
      "Ġ1190": 314,
      "Ġ1170": 315,
      "Ġ110": 316,
      "Ġ1150": 317,
      "Ġ1250": 318,
      "Ġ1130": 319,
      "Ġ90": 320,
      "200": 321,
      "Ġ1110": 322,
      "Ġ70": 323,
      "Ġ1090": 324,
      "Ġ1070": 325,
      "Ġ1050": 326,
      "Ġ1030": 327,
      "Ġ810": 328,
      "Ġ850": 329,
      "Ġ1010": 330,
      "Ġ610": 331,
      "Ġ970": 332,
      "Ġ550": 333,
      "Ġ530": 334,
      "Ġ630": 335,
      "Ġ990": 336,
      "Ġ510": 337,
      "Ġ830": 338,
      "Ġ750": 339,
      "Ġ590": 340,
      "Ġ910": 341,
      "Ġ570": 342,
      "Ġ870": 343,
      "Ġ690": 344,
      "Ġ650": 345,
      "Ġ950": 346,
      "Ġ790": 347,
      "Ġ890": 348,
      "Ġ670": 349,
      "Ġ470": 350,
      "Ġ730": 351,
      "Ġ490": 352,
      "Ġ450": 353,
      "Ġ350": 354,
      "Ġ770": 355,
      "Ġ930": 356,
      "Ġ710": 357,
      "Ġ430": 358,
      "Ġ370": 359,
      "Ġ410": 360,
      "Ġ50": 361,
      "Ġ390": 362,
      "Ġ330": 363,
      "Ġ270": 364,
      "Ġ290": 365,
      "Ġ310": 366,
      "Ġ250": 367,
      "Ġ230": 368,
      "Ġ210": 369,
      "Ġ190": 370,
      "Ġ170": 371,
      "Ġ150": 372,
      "Ġ130": 373,
      "Ġ1240": 374,
      "Ġ1220": 375,
      "26": 376,
      "264": 377,
      "Ġ1200": 378,
      "Ġ1180": 379,
      "Ġ1160": 380,
      "Ġ1140": 381,
      "Ġ1120": 382,
      "Ġ1100": 383,
      "Ġ1080": 384,
      "Ġ1040": 385,
      "Ġ1020": 386,
      "Ġ520": 387,
      "Ġ1060": 388,
      "Ġ840": 389,
      "Ġ820": 390,
      "Ġ800": 391,
      "Ġ1260": 392,
      "Ġ460": 393,
      "Ġ56": 394,
      "Ġ560": 395,
      "Ġ980": 396,
      "Ġ740": 397,
      "Ġ620": 398,
      "Ġ860": 399,
      "Ġ680": 400,
      "Ġ880": 401,
      "Ġ780": 402,
      "Ġ900": 403,
      "Ġ660": 404,
      "Ġ540": 405,
      "Ġ640": 406,
      "Ġ600": 407,
      "Ġ580": 408,
      "Ġ340": 409,
      "Ġ440": 410,
      "Ġ940": 411,
      "Ġ760": 412,
      "Ġ480": 413,
      "Ġ720": 414,
      "Ġ920": 415,
      "Ġ960": 416,
      "Ġ1000": 417,
      "Ġ400": 418,
      "Ġ500": 419,
      "Ġ700": 420,
      "Ġ360": 421,
      "Ġ420": 422,
      "Ġ240": 423,
      "Ġ380": 424,
      "Ġ320": 425,
      "Ġ280": 426,
      "Ġ260": 427,
      "Ġ220": 428,
      "Ġ200": 429,
      "Ġ180": 430,
      "Ġ160": 431,
      "28": 432,
      "288": 433,
      "Ġ140": 434,
      "Ġ120": 435,
      "Ġ100": 436,
      "Ġ80": 437,
      "Ġ60": 438,
      "12": 439,
      "312": 440,
      "Ġ40": 441,
      "Ġ20": 442,
      "33": 443,
      "336": 444,
      "360": 445,
      "38": 446,
      "384": 447,
      "408": 448,
      "32": 449,
      "432": 450,
      "456": 451,
      "480": 452,
      "504": 453,
      "528": 454,
      "52": 455,
      "552": 456,
      "57": 457,
      "576": 458,
      "600": 459,
      "624": 460,
      "648": 461,
      "672": 462
    },
    "merges": [
      "Ġ 0",
      "Ġ 1",
      "Ġ -",
      "3 0",
      "Ġ1 5",
      "a t",
      "d at",
      "Ġ 30",
      "Ġ30 0",
      "2 4",
      "1 0",
      "9 0",
      "5 0",
      "7 0",
      "2 0",
      "Ġ1 1",
      "5 6",
      "Ġ1 0",
      "Ġ 24",
      "Ġ 8",
      "Ġ300 3",
      "Ġ300 4",
      "Ġ300 5",
      "Ġ24 56",
      "Ġ 6",
      "Ġ300 2",
      "Ġ300 1",
      "Ġ 4",
      "Ġ 9",
      "Ġ 7",
      "Ġ 3",
      "Ġ 5",
      "Ġ 2",
      "4 8",
      "7 2",
      "6 0",
      "Ġ1 2",
      "8 0",
      "9 6",
      "4 0",
      "1 6",
      "1 20",
      "1 4",
      "14 4",
      "16 8",
      "1 9",
      "19 2",
      "0 0",
      "24 0",
      "2 16",
      "Ġ12 10",
      "Ġ12 30",
      "Ġ11 90",
      "Ġ11 70",
      "Ġ1 10",
      "Ġ11 50",
      "Ġ12 50",
      "Ġ11 30",
      "Ġ 90",
      "20 0",
      "Ġ11 10",
      "Ġ 70",
      "Ġ10 90",
      "Ġ10 70",
      "Ġ10 50",
      "Ġ10 30",
      "Ġ8 10",
      "Ġ8 50",
      "Ġ10 10",
      "Ġ6 10",
      "Ġ9 70",
      "Ġ5 50",
      "Ġ5 30",
      "Ġ6 30",
      "Ġ9 90",
      "Ġ5 10",
      "Ġ8 30",
      "Ġ7 50",
      "Ġ5 90",
      "Ġ9 10",
      "Ġ5 70",
      "Ġ8 70",
      "Ġ6 90",
      "Ġ6 50",
      "Ġ9 50",
      "Ġ7 90",
      "Ġ8 90",
      "Ġ6 70",
      "Ġ4 70",
      "Ġ7 30",
      "Ġ4 90",
      "Ġ4 50",
      "Ġ3 50",
      "Ġ7 70",
      "Ġ9 30",
      "Ġ7 10",
      "Ġ4 30",
      "Ġ3 70",
      "Ġ4 10",
      "Ġ 50",
      "Ġ3 90",
      "Ġ3 30",
      "Ġ2 70",
      "Ġ2 90",
      "Ġ3 10",
      "Ġ2 50",
      "Ġ2 30",
      "Ġ2 10",
      "Ġ1 90",
      "Ġ1 70",
      "Ġ15 0",
      "Ġ1 30",
      "Ġ1 240",
      "Ġ12 20",
      "2 6",
      "26 4",
      "Ġ1 200",
      "Ġ11 80",
      "Ġ11 60",
      "Ġ11 40",
      "Ġ11 20",
      "Ġ110 0",
      "Ġ10 80",
      "Ġ10 40",
      "Ġ10 20",
      "Ġ5 20",
      "Ġ10 60",
      "Ġ8 40",
      "Ġ8 20",
      "Ġ8 00",
      "Ġ12 60",
      "Ġ4 60",
      "Ġ 56",
      "Ġ56 0",
      "Ġ9 80",
      "Ġ7 40",
      "Ġ6 20",
      "Ġ8 60",
      "Ġ6 80",
      "Ġ8 80",
      "Ġ7 80",
      "Ġ90 0",
      "Ġ6 60",
      "Ġ5 40",
      "Ġ6 40",
      "Ġ6 00",
      "Ġ5 80",
      "Ġ3 40",
      "Ġ4 40",
      "Ġ9 40",
      "Ġ7 60",
      "Ġ4 80",
      "Ġ7 20",
      "Ġ9 20",
      "Ġ9 60",
      "Ġ10 00",
      "Ġ4 00",
      "Ġ50 0",
      "Ġ70 0",
      "Ġ3 60",
      "Ġ4 20",
      "Ġ24 0",
      "Ġ3 80",
      "Ġ3 20",
      "Ġ2 80",
      "Ġ2 60",
      "Ġ2 20",
      "Ġ 200",
      "Ġ1 80",
      "Ġ1 60",
      "2 8",
      "28 8",
      "Ġ1 40",
      "Ġ1 20",
      "Ġ10 0",
      "Ġ8 0",
      "Ġ6 0",
      "1 2",
      "3 12",
      "Ġ4 0",
      "Ġ 20",
      "3 3",
      "33 6",
      "3 60",
      "3 8",
      "38 4",
      "40 8",
      "3 2",
      "4 32",
      "4 56",
      "48 0",
      "50 4",
      "5 28",
      "5 2",
      "5 52",
      "5 7",
      "57 6",
      "60 0",
      "6 24",
      "6 48",
      "6 72"
    ]
  }
}